{
  "backend/lib/Notification.mo": "Defines notification types and a Notification record including metadata, read status, and optional IMEI association.",
  "backend/lib/Statistics.mo": "Defines data structures for overall statistics, monthly report counts, and phone status breakdowns.",
  "backend/main.mo": "Main canister actor defining phone, user, report, notification, invite, PIN, and ownership data structures plus core storage and authorization logic.",
  "feature_evidence.json": "Lists feature evidence entries with associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files and their roles in the application.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point configuring meta tags, PWA settings, and loading the React root script.",
  "frontend/src/App.tsx": "Root app component handling authentication, activation, profile setup gating, and rendering routed content via Outlet.",
  "frontend/src/components/ActivationPendingScreen.tsx": "UI screen shown to authenticated but inactive users with instructions, principal copy, and logout actions.",
  "frontend/src/components/ImeiHistoryTimeline.tsx": "Renders a timeline of IMEI events with icons, labels, timestamps, and loading skeletons. Computes hand-off counts and formats event display using UI components.",
  "frontend/src/components/InviteGate.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/LanguageSwitcher.tsx": "Provides a dropdown button to switch between Indonesian and English using the app’s i18n system.",
  "frontend/src/components/MainLayout.tsx": "Defines the main application layout with header, content area, bottom navigation tabs, and optional admin tab. Integrates notifications, identity hooks, and language switching.",
  "frontend/src/components/NotificationPopup.tsx": "Displays a popup notification with type‑based styling and auto‑dismiss behavior. Shows an icon, title, message, optional IMEI, and close button.",
  "frontend/src/components/PinSettingsDialog.tsx": "Modal dialog for setting or changing a 4‑digit PIN with validation and mutation handling. Supports current PIN entry when changing an existing PIN.",
  "frontend/src/components/ProfileSetupModal.tsx": "Full‑screen modal to collect and save user profile info (name, email, city) with form validation and loading state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, initializing access control and invalidating related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and login state using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors, covering access state, user profiles, activation, PIN checks, and related mutations.",
  "frontend/src/i18n/index.ts": "Implements a simple i18n system with language management, resource storage, subscriptions, and Indonesian translations.",
  "frontend/src/i18n/locales/en.json": "English translation resource file containing UI text for login, tabs, about section, and other app features.",
  "frontend/src/i18n/locales/id.json": "Indonesian translation resource file mirroring English keys for UI text and app content.",
  "frontend/src/i18n/useTranslation.ts": "React hook providing access to translation functions and language switching with automatic re-render on language change.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables, base theming, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page with translated content explaining purpose and blockchain benefits using styled UI components.",
  "frontend/src/pages/AdminInviteManagementPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/pages/AdminUserActivationPage.tsx": "Provides UI for admins to validate a Principal ID and activate a user via mutation hook.",
  "frontend/src/pages/CheckImeiPage.tsx": "Allows users to check an IMEI’s status and view its history, showing different result cards based on phone status.",
  "frontend/src/pages/HomePage.tsx": "Displays statistics and recent theft reports using data from backend hooks with loading states.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login screen using Internet Identity with feature descriptions and translation support.",
  "frontend/src/pages/MyPhonesPage.tsx": "Manages listing, adding, and releasing user phones with PIN and activation checks, using dialogs for registration and release actions.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with an error icon and a button to return home.",
  "frontend/src/pages/NotificationsPage.tsx": "Fetches and displays notifications with icons, timestamps, and controls to mark items as read.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile details, account activation status, and PIN settings with logout support.",
  "frontend/src/pages/ReportFoundPage.tsx": "Provides a form to report a found phone by IMEI and optional finder information.",
  "frontend/src/pages/ReportLostPage.tsx": "Allows users to report a phone as lost or stolen, including location retrieval and details submission.",
  "frontend/src/pages/StatisticsPage.tsx": "React page that fetches and displays statistics with loading skeletons, error handling, summary cards, and charts.",
  "frontend/src/router.tsx": "Defines the TanStack React Router route tree, mapping all app pages under MainLayout and exporting the configured router.",
  "frontend/src/utils/releaseOwnershipErrors.ts": "Provides helpers to convert various backend or thrown errors into clean, user‑friendly messages for phone ownership release failures.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "JSON file describing current project state, architectural notes, known issues, and pending feature requests."
}