{
  "backend/lib/Notification.mo": "Defines notification types and a Notification record with fields for user, message, timestamp, and read status.",
  "backend/lib/Statistics.mo": "Defines statistics record types including monthly counts and phone status breakdowns.",
  "backend/main.mo": "Main backend actor managing phones, users, reports, notifications, invites, and PINs with access control and various data structures.",
  "feature_evidence.json": "Feature evidence report listing features addressed, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend source files and their responsibilities.",
  "frontend/index.css": "Tailwind-based global styles defining color variables and theming for light and dark modes.",
  "frontend/index.html": "Application HTML entry point with PWA meta tags and root mounting element.",
  "frontend/src/App.tsx": "Root React component handling authentication, access gating, loading screens, and layout selection.",
  "frontend/src/components/ImeiHistoryTimeline.tsx": "Component rendering IMEI event history with icons, labels, timestamps, and loading state.",
  "frontend/src/components/InviteGate.tsx": "UI for entering and redeeming invite codes, including URL code detection and backend redemption with query invalidation.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown button allowing users to switch between Indonesian and English.",
  "frontend/src/components/MainLayout.tsx": "Main app container managing navigation tabs, admin access, and notification popups.",
  "frontend/src/components/NotificationPopup.tsx": "Auto-dismissing popup that displays a notification with icon, title, message, and optional IMEI.",
  "frontend/src/components/PinSettingsDialog.tsx": "Dialog for setting or changing a 4‑digit security PIN with validation and backend mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Full‑screen modal prompting new users to enter and save profile details.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on user identity and invalidates related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider managing Internet Identity login, stored identity loading, and auth-client setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend calls including access state, user profiles, PIN operations, and admin actions.",
  "frontend/src/i18n/index.ts": "Custom i18n manager handling languages, resources, translation lookup, and subscription updates.",
  "frontend/src/i18n/locales/en.json": "English translation resource file containing UI strings for the app.",
  "frontend/src/i18n/locales/id.json": "Indonesian translation resource file containing UI strings for the app.",
  "frontend/src/i18n/useTranslation.ts": "Hook providing reactive translation access and language switching via the custom i18n system.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining light/dark theme variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Displays an about page with translated content explaining the app’s purpose and blockchain-backed benefits.",
  "frontend/src/pages/AdminInviteManagementPage.tsx": "Provides an admin interface to create, copy, refresh, and view invite codes with status badges.",
  "frontend/src/pages/CheckImeiPage.tsx": "Allows users to search an IMEI and view its status and history with conditional result cards.",
  "frontend/src/pages/HomePage.tsx": "Shows statistics and a list of recent theft reports with loading states and formatted timestamps.",
  "frontend/src/pages/LoginPage.tsx": "Presents a multilingual login landing page with feature highlights and a button that triggers Internet Identity login.",
  "frontend/src/pages/MyPhonesPage.tsx": "Manages user phone list with add, release, and PIN setup workflows using multiple dialogs and mutation hooks.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications with icons, timestamps, and options to mark individual or all items as read.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile details, principal ID, and provides logout and PIN settings management.",
  "frontend/src/pages/ReportFoundPage.tsx": "Allows reporting a found phone by submitting its IMEI and optional finder info via a mutation.",
  "frontend/src/pages/ReportLostPage.tsx": "Lets users report a lost or stolen active phone, auto-fetching location and submitting details through a mutation.",
  "frontend/src/pages/StatisticsPage.tsx": "React page that fetches and displays statistics with loading skeletons, error UI, and charts.",
  "frontend/src/utils/releaseOwnershipErrors.ts": "Utility to convert release-ownership errors into clean, user-friendly messages with backend message mapping.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and plugins.",
  "project_state.json": "Project metadata tracking error-handling features and issues related to phone ownership release flow."
}