{
  "backend/lib/Notification.mo": "Defines notification types and a Notification record with metadata such as user, timestamp, and read status.",
  "backend/lib/Statistics.mo": "Defines statistics structures for phone counts, status breakdowns, and monthly theft report metrics.",
  "backend/main.mo": "Main backend actor managing phones, user profiles, access control, PINs, reports, notifications, and invite states.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and related components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend source files for documentation or planning.",
  "frontend/index.css": "Tailwind-based global CSS defining light and dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point setting metadata, icons, and mounting the frontend app.",
  "frontend/src/App.tsx": "Root React component handling authentication, invite gating, profile setup, and layout rendering.",
  "frontend/src/components/ImeiHistoryTimeline.tsx": "Component that displays IMEI event history with icons, labels, timestamps, and loading state.",
  "frontend/src/components/InviteGate.tsx": "UI for entering or auto-loading an invite code, redeeming it via the backend, and updating related queries with toast feedback.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown control to switch the app’s language between Indonesian and English.",
  "frontend/src/components/MainLayout.tsx": "Main app shell handling navigation tabs, rendering pages, notifications, and optional admin features.",
  "frontend/src/components/NotificationPopup.tsx": "Auto‑dismissing popup showing notification details with type‑based styling and manual close option.",
  "frontend/src/components/PinSettingsDialog.tsx": "Dialog for setting or changing a 4‑digit security PIN with validation and backend mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter basic profile info and submit it to the backend.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and caches a backend actor based on the user’s identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for Internet Identity authentication, managing identity state, login flow, and AuthClient initialization.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, including access state, user profiles, PIN management, invites, and related mutations.",
  "frontend/src/i18n/index.ts": "Implements a lightweight i18n system with language storage, translation lookup, resource management, and subscription for UI updates.",
  "frontend/src/i18n/locales/en.json": "English translation resource file containing UI text for login, tabs, about pages, and feature descriptions.",
  "frontend/src/i18n/locales/id.json": "Indonesian translation resource file providing localized strings for login, tabs, about pages, and feature descriptions.",
  "frontend/src/i18n/useTranslation.ts": "Exports a hook that re-renders components on language change and provides translation and language switching helpers.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and custom CSS variables for light and dark themes, including typography, layout, and color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays an about page with translated content describing the app’s purpose, blockchain benefits, and features.",
  "frontend/src/pages/AdminInviteManagementPage.tsx": "Provides an admin interface to generate, copy, view, and refresh invite codes with status indicators.",
  "frontend/src/pages/CheckImeiPage.tsx": "Allows users to check an IMEI’s status and view its history, rendering different result cards based on backend phone status.",
  "frontend/src/pages/HomePage.tsx": "Shows statistics and recent theft reports with loading states and formatted timestamps.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity authentication, language switching, and feature highlights.",
  "frontend/src/pages/MyPhonesPage.tsx": "Manages user phone list, including adding phones with PIN checks and requesting phone release via dialogs.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications with icons, timestamps, and actions to mark individual or all notifications as read.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile details, principal ID, PIN status, and provides logout and PIN management options.",
  "frontend/src/pages/ReportFoundPage.tsx": "Provides a form for reporting a found phone by IMEI and optional finder contact info.",
  "frontend/src/pages/ReportLostPage.tsx": "Allows users to report a lost or stolen phone, capturing IMEI, location, details, and report type.",
  "frontend/src/pages/StatisticsPage.tsx": "React page that fetches and displays statistics with loading skeletons, error handling, and various charts and summary cards.",
  "frontend/src/utils/urlParams.ts": "Helper utilities for extracting, persisting, and clearing URL parameters, supporting both query strings and hash-based routing via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and container settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing a bug where admin invite tokens remain marked as unused, along with related features, issues, and requirements."
}