{
  "backend/lib/Notification.mo": "Defines notification types and the Notification record structure including metadata and read status.",
  "backend/lib/Statistics.mo": "Defines types for monthly report stats, phone status breakdown, and overall system statistics.",
  "backend/main.mo": "Main canister logic defining phone, user, report, PIN, invite, ownership, and notification storage plus related operations and access control.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Pre-written summaries of all frontend source files and pages.",
  "frontend/index.css": "Tailwind base configuration with OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting PWA metadata, icons, and loading the React app.",
  "frontend/src/App.tsx": "Root app component handling authentication, access checks, profile gating, splash screen, and layout selection.",
  "frontend/src/components/ActivationPendingScreen.tsx": "UI screen shown to unactivated users with instructions, principal copy button, and logout.",
  "frontend/src/components/ImeiHistoryTimeline.tsx": "Timeline component rendering IMEI event history with icons, labels, badges, and loading skeleton.",
  "frontend/src/components/InviteGate.tsx": "Empty placeholder component file.",
  "frontend/src/components/LanguageSwitcher.tsx": "Provides a dropdown button to switch between Indonesian and English using i18next.",
  "frontend/src/components/MainLayout.tsx": "Defines the app’s main layout with header, routed content, and bottom navigation tabs, including dynamic admin and notification badges.",
  "frontend/src/components/NotificationPopup.tsx": "Displays a timed popup card for notifications with type-based styling and a close button.",
  "frontend/src/components/PinSettingsDialog.tsx": "Renders a dialog for setting or changing a 4‑digit security PIN with validation and mutation handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a profile setup form for name, email, and city, submitting data via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating related queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for accessing and mutating user, access, and admin-related backend data using the actor and Internet Identity.",
  "frontend/src/i18n/index.ts": "Implements a lightweight i18n system with language storage, translation retrieval, and subscription-based updates.",
  "frontend/src/i18n/locales/en.json": "English translation resource file containing UI strings for the app.",
  "frontend/src/i18n/locales/id.json": "Indonesian translation resource file containing UI strings for the app.",
  "frontend/src/i18n/useTranslation.ts": "React hook that exposes translation functions and listens for i18n language changes.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes with custom scrollbars.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page with translated content explaining the app’s purpose and blockchain benefits using styled cards.",
  "frontend/src/pages/AdminInviteManagementPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/AdminUserActivationPage.tsx": "Provides a UI for admins to validate and activate users by Principal ID using mutation hooks.",
  "frontend/src/pages/CheckImeiPage.tsx": "Allows users to check an IMEI’s status and view history, showing result cards based on backend status.",
  "frontend/src/pages/HomePage.tsx": "Displays statistics and recent theft reports with loading states and formatted timestamps.",
  "frontend/src/pages/LoginPage.tsx": "Shows a login screen with language switcher, feature highlights, and an Internet Identity login button.",
  "frontend/src/pages/MyPhonesPage.tsx": "Manages user's phone list with dialogs for adding and releasing phones, including PIN checks and activation validation.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications with filtering, icons, timestamp formatting, and options to mark items as read.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile data, account status, PIN settings, and provides logout functionality.",
  "frontend/src/pages/ReportFoundPage.tsx": "Form for reporting a found phone by submitting its IMEI and optional contact info.",
  "frontend/src/pages/ReportLostPage.tsx": "Allows users to report a registered phone as lost or stolen, including location capture and details.",
  "frontend/src/pages/StatisticsPage.tsx": "React page that fetches statistics, showing skeleton loaders, error alerts, and charts for summary and trend data.",
  "frontend/src/utils/releaseOwnershipErrors.ts": "Utility that converts various backend or thrown errors into safe, user-friendly messages for phone ownership release failures.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with session persistence and hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Project metadata describing invitation-token activation flow, issues, and pending feature requests for fixing token reuse and user activation handling."
}