{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Prevent raw/garbled error output in Release Phone Ownership flow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Release Phone Ownership failures show a clean user-friendly error and keep the dialog usable (no raw JSON/code rendered).",
      "acceptanceCriteria": [
        "When the release action fails (e.g., wrong PIN, unauthorized, phone not found), the app shows an error toast/message in plain English and does not render any raw JSON or code-like output on screen.",
        "The release dialog remains interactive after an error (user can correct the PIN/confirmation and retry, or cancel).",
        "No React runtime error occurs from rendering non-string error objects (e.g., objects/arrays/bigints) inside JSX or toasts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MyPhonesPage.tsx",
          "operation": "modify",
          "description": "Update the Release Phone Ownership dialog flow to maintain usability on failure: keep the dialog open, avoid rendering any mutation error object directly in JSX, and (optionally) show an inline, plain-English error string derived from the same safe error-message helper used by the mutation. Ensure any displayed error is always a string and cleared on dialog open/field edits."
        },
        {
          "path": "frontend/src/utils/releaseOwnershipErrors.ts",
          "operation": "create",
          "description": "Add a small utility that safely converts unknown/structured thrown values into a plain-English string for the release ownership UI (never returns raw JSON/code; handles non-Error throws; avoids '[object Object]'). Provide a dedicated function for the UI to display/toast release errors safely."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Harden useReleasePhone error handling to extract readable messages from IC agent errors and map known traps to consistent English UI messages while preserving success behavior and query invalidation.",
      "acceptanceCriteria": [
        "`useReleasePhone` converts unknown/structured thrown values into a safe string message (no `[object Object]`, no dumped JSON).",
        "Known errors are mapped to consistent English text: invalid PIN, PIN not set, unauthorized owner, and IMEI not found.",
        "On success, the success toast remains in English and the user phones list refreshes (React Query invalidation still works)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Refactor `useReleasePhone` to treat `onError` as `unknown`, use the new `releaseOwnershipErrors` utility to extract/map a safe English message, and pass only strings to `toast.error` (never error objects). Add mapping for IMEI/phone-not-found cases and keep existing React Query invalidation + English success toast on success."
        },
        {
          "path": "frontend/src/utils/releaseOwnershipErrors.ts",
          "operation": "modify",
          "description": "Implement/extend error parsing for Internet Computer agent-style errors (e.g., reject message fields, nested error objects, unknown thrown values) and map known backend trap strings (Invalid PIN, PIN not set, Unauthorized, IMEI/phone not found) to consistent English UI messages. Ensure the returned value is always a short, user-friendly string (no JSON dumping)."
        }
      ]
    }
  ]
}